# Ejercicios Pandas DataFrames 01

1. Escribe un programa Pandas para conectarte a la base de datos datafundamentals y carga los pagos como un dataframe

In [4]:
%pip install psycopg2-binary

import pandas as pd
import psycopg2
from psycopg2 import sql
from psycopg2 import Error #importar la clase de error

Requirement already satisfied: psycopg2-binary in /anaconda/envs/azureml_py310_sdkv2/lib/python3.10/site-packages (2.9.10)
Note: you may need to restart the kernel to use updated packages.

In [5]:
#Conexión a la base de datos
def create_database_connection():
	conn = None
	try:
		conn = psycopg2.connect(
			database="datafundamentals",
			user="datafundamentals_owner",
			password="KBmgp2v5AIGf",
			host="ep-spring-shape-a82ywnyf.eastus2.azure.neon.tech",
			sslmode="require",
			port=5432
		)
		print("Connected to 'datafundamental' successfully.")
	except psycopg2.Error as err:
		print(f"Error: {err}")
	return conn

In [6]:
PGHOST='ep-spring-shape-a82ywnyf.eastus2.azure.neon.tech'
PGDATABASE='datafundamentals'
PGUSER='datafundamentals_owner'
PGPASSWORD='KBmgp2v5AIGf'

In [7]:
#Obtener todas las filas de una tabla (por ejemplo, customers)

import psycopg2
import pandas as pd

def fetch_data(query):
    conn = create_database_connection()
    df = pd.read_sql_query(query, conn)
    conn.close()
    return df
# Cargar datos de la tabla customers
query = "SELECT * FROM customers;"
df_customers = fetch_data(query)

print(df_customers.head())

Connected to 'datafundamental' successfully.
   customernumber                customername   contactfirstname  \
0             103           Atelier graphique    Carine  Schmitt
1             112          Signal Gift Stores          Jean King
2             114  Australian Collectors, Co.     Peter Ferguson
3             119           La Rochelle Gifts    Janine  Labrune
4             121          Baane Mini Imports  Jonas  Bergulfsen

          phone                       address       city     state postalcode  \
0    40.32.2555                54, rue Royale     Nantes      None      44000
1    7025551838               8489 Strong St.  Las Vegas        NV      83030
2  03 9520 4555    636 St Kilda Road, Level 3  Melbourne  Victoria       3004
3    40.67.8555  67, rue des Cinquante Otages     Nantes      None      44000
4    07-98 9555        Erling Skakkes gate 78    Stavern      None       4110

     country  salesrepemployeenumber  creditlimit
0     France                  1370.0      21000.0
1        USA                  1166.0      71800.0
2  Australia                  1611.0     117300.0
3     France                  1370.0     118200.0
4     Norway                  1504.0      81700.0

/tmp/ipykernel_12194/1207073788.py:8: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query, conn)

In [8]:
#Verificar nombres de columnas antes de la consulta

query_check_columns = """
SELECT column_name
FROM information_schema.columns
WHERE table_name = 'sales';
"""
df_columns = fetch_data(query_check_columns)
print("Columnas disponibles en la tabla 'sales':")
print(df_columns)

Connected to 'datafundamental' successfully.
Columnas disponibles en la tabla 'sales':
        column_name
0      sales_amount
1   orderlinenumber
2         orderdate
3       shippeddate
4      requireddate
5    customernumber
6    employeenumber
7   quantityordered
8         priceeach
9       ordernumber
10      productcode
11           status
12         comments

/tmp/ipykernel_12194/1207073788.py:8: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query, conn)

In [9]:
#La consulta correcta para obtener el total de ventas agrupadas por producto sería:
#Explicación de la consulta corregida:
#1. SELECT productcode, SUM(quantityordered * priceeach) AS total_sales
# Se selecciona el productcode y se calcula el total de ventas multiplicando la cantidad (quantityordered) por el precio unitario (priceeach).
#2. FROM sales Se extraen los datos de la tabla sales.
#3. GROUP BY productcode. Agrupa los resultados por cada producto.
#4. ORDER BY total_sales DESC. Ordena los resultados de mayor a menor total de ventas.
query = """
SELECT productcode,
    SUM(quantityordered * priceeach) AS total_sales
FROM sales
GROUP BY productcode
ORDER BY total_sales DESC;
"""
df_sales = fetch_data(query)
print(df_sales.head())

Connected to 'datafundamental' successfully.
  productcode  total_sales
0    S18_3232    269597.28
1    S12_1108    176903.89
2    S10_1949    176128.92
3    S10_4698    157284.51
4    S12_1099    156073.94

/tmp/ipykernel_12194/1207073788.py:8: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query, conn)

In [10]:
#Listar empleados por employeenumber y la ciudad de la oficina
query = """
SELECT *
FROM employees
WHERE employeenumber > 5000;

SELECT *
FROM employees
WHERE officecity = 'San Francisco';
"""
df_employees = fetch_data(query)
print(df_employees)

Connected to 'datafundamental' successfully.
   employeenumber             name extension                           email  \
0            1002     Diane Murphy     x5800    dmurphy@classicmodelcars.com
1            1056   Mary Patterson     x4611  mpatterso@classicmodelcars.com
2            1076    Jeff Firrelli     x9273  jfirrelli@classicmodelcars.com
3            1143      Anthony Bow     x5428       abow@classicmodelcars.com
4            1165  Leslie Jennings     x3291  ljennings@classicmodelcars.com
5            1166  Leslie Thompson     x4065  lthompson@classicmodelcars.com

   reportsto            jobtitle     officecity      officephone  \
0        NaN           President  San Francisco  +1 650 219 4782
1     1002.0            VP Sales  San Francisco  +1 650 219 4782
2     1002.0        VP Marketing  San Francisco  +1 650 219 4782
3     1056.0  Sales Manager (NA)  San Francisco  +1 650 219 4782
4     1143.0           Sales Rep  San Francisco  +1 650 219 4782
5     1143.0           Sales Rep  San Francisco  +1 650 219 4782

                  officeaddress officestate officecountry officepostalcode  \
0  100 Market Street, Suite 300          CA           USA            94080
1  100 Market Street, Suite 300          CA           USA            94080
2  100 Market Street, Suite 300          CA           USA            94080
3  100 Market Street, Suite 300          CA           USA            94080
4  100 Market Street, Suite 300          CA           USA            94080
5  100 Market Street, Suite 300          CA           USA            94080

  officeterritory
0              NA
1              NA
2              NA
3              NA
4              NA
5              NA

/tmp/ipykernel_12194/1207073788.py:8: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query, conn)

Para poder leer datos necesitamos una conexión, y una vez establecida podremos lanzar una query. Recibimos una f que me permita conectarme.

In [11]:
#Filtrar los pagos mayores a 1000 en la tabla payments

query = """
SELECT * FROM payments
WHERE amount > 1000;
"""

df_payments = fetch_data(query)
print(df_payments)

Connected to 'datafundamental' successfully.
     customernumber checknumber paymentdate    amount
0               103    HQ336336  2004-10-19   6066.78
1               103    JM555205  2003-06-05  14571.44
2               103    OM314933  2004-12-18   1676.14
3               112    BO864823  2004-12-17  14191.12
4               112     HQ55022  2003-06-06  32641.98
..              ...         ...         ...       ...
254             495    BH167026  2003-12-26  59265.14
255             495    FN155234  2004-05-14   6276.60
256             496    EU531600  2005-05-25  30253.75
257             496    MB342426  2003-07-16  32077.44
258             496     MN89921  2004-12-31  52166.00

[259 rows x 4 columns]

/tmp/ipykernel_12194/1207073788.py:8: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query, conn)

In [12]:
df_customers.head() #para tener una visión general de los datos

,customernumber,customername,contactfirstname,phone,address,city,state,postalcode,country,salesrepemployeenumber,creditlimit
0,103,Atelier graphique,Carine Schmitt,40.32.2555,"54, rue Royale",Nantes,None,44000,France,1370.0,21000.0
1,112,Signal Gift Stores,Jean King,7025551838,8489 Strong St.,Las Vegas,NV,83030,USA,1166.0,71800.0
2,114,"Australian Collectors, Co.",Peter Ferguson,03 9520 4555,"636 St Kilda Road, Level 3",Melbourne,Victoria,3004,Australia,1611.0,117300.0
3,119,La Rochelle Gifts,Janine Labrune,40.67.8555,"67, rue des Cinquante Otages",Nantes,None,44000,France,1370.0,118200.0
4,121,Baane Mini Imports,Jonas Bergulfsen,07-98 9555,Erling Skakkes gate 78,Stavern,None,4110,Norway,1504.0,81700.0

In [13]:
df_customers.tail()

,customernumber,customername,contactfirstname,phone,address,city,state,postalcode,country,salesrepemployeenumber,creditlimit
112,486,Motor Mint Distributors Inc.,Rosa Salazar,2155559857,11328 Douglas Av.,Philadelphia,PA,71270,USA,1323.0,72600.0
113,487,Signal Collectibles Ltd.,Sue Taylor,4155554312,2793 Furth Circle,Brisbane,CA,94217,USA,1165.0,60300.0
114,489,"Double Decker Gift Stores, Ltd",Thomas Smith,(171) 555-7555,120 Hanover Sq.,London,None,WA1 1DP,UK,1501.0,43300.0
115,495,Diecast Collectables,Valarie Franco,6175552555,6251 Ingle Ln.,Boston,MA,51003,USA,1188.0,85100.0
116,496,Kellys Gift Shop,Tony Snowden,+64 9 5555500,Arenales 1938 3A,Auckland,None,None,New Zealand,1612.0,110000.0

In [14]:
df_customers.describe()

       customernumber  salesrepemployeenumber    creditlimit
count      117.000000               95.000000     117.000000
mean       297.794872             1384.094737   66964.957265
std        117.318939              161.465435   45765.794930
min        103.000000             1165.000000       0.000000
25%        198.000000             1251.000000   39800.000000
50%        299.000000             1370.000000   72600.000000
75%        382.000000             1504.000000   95100.000000
max        496.000000             1702.000000  227600.000000

In [15]:
#git add . (añade todos los cambios)
#git commit -m "mensaje" (confirma los cambios)
#git push (sube los cambios al repositorio remoto)

#psycopg2 solo vale para posgress
#librería genérica para conectarse a cualquier base de datos: sqlalchemy

Ejercicios usando PANDAS: LOC E ILOC. Una vez que 􀆟enes los datos cargados en un DataFrame, puedes aplicar los siguientes ejercicios

In [16]:
#a) Filtrar clientes por país usando loc
# Filtrar clientes de España

df_spain = df_customers.loc[df_customers['country'] == 'Spain']
print(df_spain)

     customernumber                customername   contactfirstname  \
10              141      Euro+ Shopping Channel      Diego  Freyre
36              216          Enaco Distributors  Eduardo  Saavedra
41              237               ANG Resellers  Alejandra  Camino
73              344                 CAF Imports    Jesus Fernandez
101             458  Corrida Auto Replicas, Ltd     Martín  Sommer
104             465         Anton Designs, Ltd.       Carmen Anton
111             484  Iberia Gift Imports, Corp.   José Pedro  Roel

               phone                                address       city state  \
10    (91) 555 94 44                     C/ Moralzarzal, 86     Madrid  None
36     (93) 203 4555                 Rambla de Cataluña, 23  Barcelona  None
41     (91) 745 6555                            Gran Vía, 1     Madrid  None
73   +34 913 728 555  Merchants House, 27-30 Merchants Quay     Madrid  None
101   (91) 555 22 82                         C/ Araquil, 67     Madrid  None
104   +34 913 728555       c/ Gobelas, 19-1 Urb. La Florida     Madrid  None
111   (95) 555 82 82                          C/ Romero, 33    Sevilla  None

    postalcode country  salesrepemployeenumber  creditlimit
10       28034   Spain                  1370.0     227600.0
36       08022   Spain                  1702.0      60300.0
41       28001   Spain                     NaN          0.0
73       28023   Spain                  1702.0      59600.0
101      28023   Spain                  1702.0     104600.0
104      28023   Spain                     NaN          0.0
111      41101   Spain                  1702.0      65700.0

In [17]:
#b) Seleccionar filas específicas por índice usando iloc
# Obtener las primeras 10 filas de la tabla employees
df_first_10 = df_employees.iloc[:10]
print(df_first_10)

   employeenumber             name extension                           email  \
0            1002     Diane Murphy     x5800    dmurphy@classicmodelcars.com
1            1056   Mary Patterson     x4611  mpatterso@classicmodelcars.com
2            1076    Jeff Firrelli     x9273  jfirrelli@classicmodelcars.com
3            1143      Anthony Bow     x5428       abow@classicmodelcars.com
4            1165  Leslie Jennings     x3291  ljennings@classicmodelcars.com
5            1166  Leslie Thompson     x4065  lthompson@classicmodelcars.com

   reportsto            jobtitle     officecity      officephone  \
0        NaN           President  San Francisco  +1 650 219 4782
1     1002.0            VP Sales  San Francisco  +1 650 219 4782
2     1002.0        VP Marketing  San Francisco  +1 650 219 4782
3     1056.0  Sales Manager (NA)  San Francisco  +1 650 219 4782
4     1143.0           Sales Rep  San Francisco  +1 650 219 4782
5     1143.0           Sales Rep  San Francisco  +1 650 219 4782

                  officeaddress officestate officecountry officepostalcode  \
0  100 Market Street, Suite 300          CA           USA            94080
1  100 Market Street, Suite 300          CA           USA            94080
2  100 Market Street, Suite 300          CA           USA            94080
3  100 Market Street, Suite 300          CA           USA            94080
4  100 Market Street, Suite 300          CA           USA            94080
5  100 Market Street, Suite 300          CA           USA            94080

  officeterritory
0              NA
1              NA
2              NA
3              NA
4              NA
5              NA

In [18]:
#c) Seleccionar columnas específicas usando loc
# Verificar nombres de columnas antes de la consulta

query_check_columns = """
SELECT column_name
FROM information_schema.columns
WHERE table_name = 'customers';
"""
df_columns = fetch_data(query_check_columns)
print("Columnas disponibles en la tabla 'customers':")
print(df_columns)

# Obtener solo número de teléfono y el límite de crédito de los clientes
df_names_emails = df_customers.loc[:, ['creditlimit', 'phone']]
print(df_names_emails.head())

Connected to 'datafundamental' successfully.

Columnas disponibles en la tabla 'customers':
               column_name
0           customernumber
1   salesrepemployeenumber
2              creditlimit
3                    phone
4                  address
5                     city
6                    state
7               postalcode
8                  country
9             customername
10        contactfirstname
   creditlimit         phone
0      21000.0    40.32.2555
1      71800.0    7025551838
2     117300.0  03 9520 4555
3     118200.0    40.67.8555
4      81700.0    07-98 9555

/tmp/ipykernel_12194/1207073788.py:8: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query, conn)

In [19]:
#d) Filtrar cada precio del año superior a 100 unidades con loc

query_check_columns = """
SELECT column_name
FROM information_schema.columns
WHERE table_name = 'sales';
"""
df_columns = fetch_data(query_check_columns)
print("Columnas disponibles en la tabla 'sales':")
print(df_columns)

query = """
SELECT *
FROM sales
WHERE priceeach > 100;
"""
df_high_sales_sql = fetch_data(query)
print(df_high_sales_sql)

Connected to 'datafundamental' successfully.
Columnas disponibles en la tabla 'sales':
        column_name
0      sales_amount
1   orderlinenumber
2         orderdate
3       shippeddate
4      requireddate
5    customernumber
6    employeenumber
7   quantityordered
8         priceeach
9       ordernumber
10      productcode
11           status
12         comments

/tmp/ipykernel_12194/1207073788.py:8: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query, conn)

Connected to 'datafundamental' successfully.
      ordernumber  orderlinenumber   orderdate shippeddate requireddate  \
0           10100                3  2003-01-06  2003-01-10   2003-01-13
1           10101                1  2003-01-09  2003-01-11   2003-01-18
2           10101                4  2003-01-09  2003-01-11   2003-01-18
3           10103                1  2003-01-29  2003-02-02   2003-02-07
4           10103                4  2003-01-29  2003-02-02   2003-02-07
...           ...              ...         ...         ...          ...
1034        10425                7  2005-05-31        None   2005-06-07
1035        10425                8  2005-05-31        None   2005-06-07
1036        10425                9  2005-05-31        None   2005-06-07
1037        10425               12  2005-05-31        None   2005-06-07
1038        10425               13  2005-05-31        None   2005-06-07

      customernumber  employeenumber productcode      status  \
0                363            1216    S18_1749     Shipped
1                128            1504    S18_2795     Shipped
2                128            1504    S18_2325     Shipped
3                121            1504    S24_2300     Shipped
4                121            1504    S10_4962     Shipped
...              ...             ...         ...         ...
1034             119            1370    S18_2319  In Process
1035             119            1370    S18_3232  In Process
1036             119            1370    S24_2300  In Process
1037             119            1370    S10_4962  In Process
1038             119            1370    S18_4600  In Process

                    comments  quantityordered  priceeach  sales_amount
0                       None               30     136.00       4080.00
1     Check on availability.               26     167.06       4343.56
2     Check on availability.               25     108.06       2701.50
3                       None               36     107.34       3864.24
4                       None               42     119.67       5026.14
...                      ...              ...        ...           ...
1034                    None               38     117.82       4477.16
1035                    None               28     140.55       3935.40
1036                    None               49     127.79       6261.71
1037                    None               38     131.49       4996.62
1038                    None               38     107.76       4094.88

[1039 rows x 13 columns]

/tmp/ipykernel_12194/1207073788.py:8: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query, conn)

In [20]:
#e) Actualizar valores en el DataFrame usando loc

# Verificar los nombres de las columnas
query_check_columns = """
SELECT column_name
FROM information_schema.columns
WHERE table_name = 'customers';
"""
df_columns = fetch_data(query_check_columns)
print("Columnas disponibles en la tabla 'customers':")
print(df_columns)
# Verificar los valores únicos en la columna customernumber
print(df_customers['customernumber'].unique())
# Cambiar el país de los clientes con ID 150 a 'France'
df_customers.loc[df_customers['customernumber'] > 150, 'country'] = 'France'
print(df_customers[df_customers['customernumber'] > 150])

Connected to 'datafundamental' successfully.
Columnas disponibles en la tabla 'customers':
               column_name
0           customernumber
1   salesrepemployeenumber
2              creditlimit
3                    phone
4                  address
5                     city
6                    state
7               postalcode
8                  country
9             customername
10        contactfirstname
[103 112 114 119 121 124 125 128 129 131 141 144 145 146 151 157 161 166
 167 168 169 171 172 173 175 181 186 187 189 198 201 202 204 205 206 209
 216 219 223 227 233 237 239 240 242 247 249 250 256 259 260 273 276 278
 282 286 293 298 299 303 307 311 314 319 320 321 323 324 328 333 334 335
 339 344 347 348 350 353 356 357 361 362 363 369 376 379 381 382 386 406
 409 412 415 424 443 447 448 450 452 455 456 458 459 462 465 471 473 475
 477 480 481 484 486 487 489 495 496]
     customernumber                    customername contactfirstname  \
14              151              Muscle Machine Inc       Jeff Young
15              157           Diecast Classics Inc.     Kelvin Leong
16              161            Technics Stores Inc.   Juri Hashimoto
17              166                Handji Gifts& Co  Wendy Victorino
18              167                    Herkku Gifts    Veysel Oeztan
..              ...                             ...              ...
112             486    Motor Mint Distributors Inc.     Rosa Salazar
113             487        Signal Collectibles Ltd.       Sue Taylor
114             489  Double Decker Gift Stores, Ltd    Thomas  Smith
115             495            Diecast Collectables   Valarie Franco
116             496                Kellys Gift Shop     Tony Snowden

              phone                             address          city state  \
14       2125557413        4092 Furth Circle, Suite 400           NYC    NY
15       2155551555                    7586 Pompton St.     Allentown    PA
16       6505556809                   9408 Furth Circle    Burlingame    CA
17     +65 224 1555  106 Linden Road Sandown, 2nd Floor     Singapore  None
18    +47 2267 3215     Brehmen St. 121, PR 334 Sentrum        Bergen  None
..              ...                                 ...           ...   ...
112      2155559857                   11328 Douglas Av.  Philadelphia    PA
113      4155554312                   2793 Furth Circle      Brisbane    CA
114  (171) 555-7555                     120 Hanover Sq.        London  None
115      6175552555                      6251 Ingle Ln.        Boston    MA
116   +64 9 5555500                    Arenales 1938 3A    Auckland    None

    postalcode country  salesrepemployeenumber  creditlimit
14       10022  France                  1286.0     138500.0
15       70267  France                  1216.0     100600.0
16       94217  France                  1165.0      84600.0
17      069045  France                  1612.0      97900.0
18      N 5804  France                  1504.0      96800.0
..         ...     ...                     ...          ...
112      71270  France                  1323.0      72600.0
113      94217  France                  1165.0      60300.0
114    WA1 1DP  France                  1501.0      43300.0
115      51003  France                  1188.0      85100.0
116       None  France                  1612.0     110000.0

[103 rows x 11 columns]

/tmp/ipykernel_12194/1207073788.py:8: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query, conn)

In [21]:
#f) Seleccionar filas impares usando iloc

# Cargar el Dataframe de una consulta SQL
query = "SELECT * FROM products;"
df_products = fetch_data(query)

# Mostrar las columnas disponibles para verificar la carga
print(df_products.columns)

# Seleccionar solo filas impares del DataFrame de productos
df_odd_rows = df_products.iloc[1::2]
print(df_odd_rows)

Connected to 'datafundamental' successfully.

Index(['productcode', 'productname', 'productline', 'linetextdescription',
       'linehtmldescription', 'lineimage'],
      dtype='object')
    productcode                                  productname  \
1      S10_1949                     1952 Alpine Renault 1300
3      S10_4698         2003 Harley-Davidson Eagle Drag Bike
5      S10_4962                       1962 LanciaA Delta 16V
7      S12_1108                            2001 Ferrari Enzo
9      S12_2823                             2002 Suzuki XREO
11     S12_3380                           1968 Dodge Charger
13     S12_3990                      1970 Plymouth Hemi Cuda
15     S12_4675                           1969 Dodge Charger
17     S18_1129                              1993 Mazda RX-7
19     S18_1367     1936 Mercedes-Benz 500K Special Roadster
21     S18_1662                  1980s Black Hawk Helicopter
23     S18_1889                  1948 Porsche 356-A Roadster
25     S18_2238               1998 Chrysler Plymouth Prowler
27     S18_2319                       1964 Mercedes Tour Bus
29     S18_2432                        1926 Ford Fire Engine
31     S18_2625          1936 Harley Davidson El Knucklehead
33     S18_2870                 1999 Indy 500 Monte Carlo SS
35    S700_1938                                The Mayflower
37     S18_3029                       1999 Yamaha Speed Boat
39     S18_3140                            1903 Ford Model A
41     S18_3233                            1985 Toyota Supra
43     S18_3278                         1969 Dodge Super Bee
45     S18_3482                        1976 Ford Gran Torino
47     S18_3782                             1957 Vespa GS150
49     S18_4027                        1970 Triumph Spitfire
51     S18_4522                          1904 Buick Runabout
53     S18_4668                      1939 Cadillac Limousine
55     S18_4933                        1957 Ford Thunderbird
57     S24_1444                           1970 Dodge Coronet
59    S700_1691                  American Airlines: B767-300
61     S24_1785             1928 British Royal Navy Airplane
63     S24_2000                     1960 BSA Gold Star DBD34
65     S24_2022    1938 Cadillac V-16 Presidential Limousine
67     S24_2360                      1982 Ducati 900 Monster
69     S24_2840          1958 Chevy Corvette Limited Edition
71     S24_2887                            1952 Citroen-15CV
73     S24_2972                      1982 Lamborghini Diablo
75     S24_3191                    1969 Chevrolet Camaro Z28
77     S24_3420                    1937 Horch 930V Limousine
79     S24_3816                     1940 Ford Delivery Sedan
81     S24_3949                     Corsair F4U ( Bird Cage)
83     S24_4048            1992 Porsche Cayenne Turbo Silver
85     S24_4620                        1961 Chevrolet Impala
87     S32_1374                             1997 BMW F650 ST
89     S32_2509                  1954 Greyhound Scenicruiser
91     S32_3522  1996 Peterbilt 379 Stake Bed with Outrigger
93     S32_4485                    1974 Ducati 350 Mk3 Desmo
95     S50_1392             Diamond T620 Semi-Skirted Tanker
97     S50_4713                           2002 Yamaha YZR M1
99    S700_2047                                   HMS Bounty
101   S700_2610                    The USS Constitution Ship
103   S700_2834                                ATA: B757-300
105   S700_3505                                  The Titanic
107   S700_4002                    American Airlines: MD-11S
109    S72_3212                                   Pont Yacht

          productline                                linetextdescription  \
1        Classic Cars  Attention car enthusiasts: Make your wildest c...
3         Motorcycles  Our motorcycles are state of the art replicas ...
5        Classic Cars  Attention car enthusiasts: Make your wildest c...
7        Classic Cars  Attention car enthusiasts: Make your wildest c...
9         Motorcycles  Our motorcycles are state of the art replicas ...
11       Classic Cars  Attention car enthusiasts: Make your wildest c...
13       Classic Cars  Attention car enthusiasts: Make your wildest c...
15       Classic Cars  Attention car enthusiasts: Make your wildest c...
17       Classic Cars  Attention car enthusiasts: Make your wildest c...
19       Vintage Cars  Our Vintage Car models realistically portray a...
21             Planes  Unique, diecast airplane and helicopter replic...
23       Classic Cars  Attention car enthusiasts: Make your wildest c...
25       Classic Cars  Attention car enthusiasts: Make your wildest c...
27   Trucks and Buses  The Truck and Bus models are realistic replica...
29   Trucks and Buses  The Truck and Bus models are realistic replica...
31        Motorcycles  Our motorcycles are state of the art replicas ...
33       Classic Cars  Attention car enthusiasts: Make your wildest c...
35              Ships  The perfect holiday or anniversary gift for ex...
37              Ships  The perfect holiday or anniversary gift for ex...
39       Vintage Cars  Our Vintage Car models realistically portray a...
41       Classic Cars  Attention car enthusiasts: Make your wildest c...
43       Classic Cars  Attention car enthusiasts: Make your wildest c...
45       Classic Cars  Attention car enthusiasts: Make your wildest c...
47        Motorcycles  Our motorcycles are state of the art replicas ...
49       Classic Cars  Attention car enthusiasts: Make your wildest c...
51       Vintage Cars  Our Vintage Car models realistically portray a...
53       Vintage Cars  Our Vintage Car models realistically portray a...
55       Classic Cars  Attention car enthusiasts: Make your wildest c...
57       Classic Cars  Attention car enthusiasts: Make your wildest c...
59             Planes  Unique, diecast airplane and helicopter replic...
61             Planes  Unique, diecast airplane and helicopter replic...
63        Motorcycles  Our motorcycles are state of the art replicas ...
65       Vintage Cars  Our Vintage Car models realistically portray a...
67        Motorcycles  Our motorcycles are state of the art replicas ...
69       Classic Cars  Attention car enthusiasts: Make your wildest c...
71       Classic Cars  Attention car enthusiasts: Make your wildest c...
73       Classic Cars  Attention car enthusiasts: Make your wildest c...
75       Classic Cars  Attention car enthusiasts: Make your wildest c...
77       Vintage Cars  Our Vintage Car models realistically portray a...
79       Vintage Cars  Our Vintage Car models realistically portray a...
81             Planes  Unique, diecast airplane and helicopter replic...
83       Classic Cars  Attention car enthusiasts: Make your wildest c...
85       Classic Cars  Attention car enthusiasts: Make your wildest c...
87        Motorcycles  Our motorcycles are state of the art replicas ...
89   Trucks and Buses  The Truck and Bus models are realistic replica...
91   Trucks and Buses  The Truck and Bus models are realistic replica...
93        Motorcycles  Our motorcycles are state of the art replicas ...
95   Trucks and Buses  The Truck and Bus models are realistic replica...
97        Motorcycles  Our motorcycles are state of the art replicas ...
99              Ships  The perfect holiday or anniversary gift for ex...
101             Ships  The perfect holiday or anniversary gift for ex...
103            Planes  Unique, diecast airplane and helicopter replic...
105             Ships  The perfect holiday or anniversary gift for ex...
107            Planes  Unique, diecast airplane and helicopter replic...
109             Ships  The perfect holiday or anniversary gift for ex...

    linehtmldescription lineimage
1                  None      None
3                  None      None
5                  None      None
7                  None      None
9                  None      None
11                 None      None
13                 None      None
15                 None      None
17                 None      None
19                 None      None
21                 None      None
23                 None      None
25                 None      None
27                 None      None
29                 None      None
31                 None      None
33                 None      None
35                 None      None
37                 None      None
39                 None      None
41                 None      None
43                 None      None
45                 None      None
47                 None      None
49                 None      None
51                 None      None
53                 None      None
55                 None      None
57                 None      None
59                 None      None
61                 None      None
63                 None      None
65                 None      None
67                 None      None
69                 None      None
71                 None      None
73                 None      None
75                 None      None
77                 None      None
79                 None      None
81                 None      None
83                 None      None
85                 None      None
87                 None      None
89                 None      None
91                 None      None
93                 None      None
95                 None      None
97                 None      None
99                 None      None
101                None      None
103                None      None
105                None      None
107                None      None
109                None      None

/tmp/ipykernel_12194/1207073788.py:8: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query, conn)

In [22]:
#g) Ordenar los productos por código descendente y seleccionar los primeros 5

# Cargar el Dataframe de una consulta SQL
query = "SELECT * FROM products;"
df_products = fetch_data(query)

# Mostrar las columnas disponibles para verificar la carga
print(df_products.columns)

df_top_products = df_products.sort_values(by='productcode',
ascending=False).iloc[:5]
print(df_top_products)

Connected to 'datafundamental' successfully.

Index(['productcode', 'productname', 'productline', 'linetextdescription',
       'linehtmldescription', 'lineimage'],
      dtype='object')
    productcode                productname productline  \
109    S72_3212                 Pont Yacht       Ships
108    S72_1253           Boeing X-32A JSF      Planes
107   S700_4002  American Airlines: MD-11S      Planes
106   S700_3962             The Queen Mary       Ships
105   S700_3505                The Titanic       Ships

                                   linetextdescription linehtmldescription  \
109  The perfect holiday or anniversary gift for ex...                None
108  Unique, diecast airplane and helicopter replic...                None
107  Unique, diecast airplane and helicopter replic...                None
106  The perfect holiday or anniversary gift for ex...                None
105  The perfect holiday or anniversary gift for ex...                None

    lineimage
109      None
108      None
107      None
106      None
105      None

/tmp/ipykernel_12194/1207073788.py:8: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query, conn)

In [23]:
#h) Calcular estadísticas descriptivas de las ventas

# Cargar el Dataframe de una consulta SQL
query = "SELECT * FROM sales;"
df_sales = fetch_data(query)

# Mostrar las columnas disponibles para verificar la carga
print(df_sales.columns)

# Calcular estadísticas básicas
print(df_sales[['employeenumber', 'orderdate']].describe())

Connected to 'datafundamental' successfully.

Index(['ordernumber', 'orderlinenumber', 'orderdate', 'shippeddate',
       'requireddate', 'customernumber', 'employeenumber', 'productcode',
       'status', 'comments', 'quantityordered', 'priceeach', 'sales_amount'],
      dtype='object')
       employeenumber
count     2859.000000
mean      1380.933193
std        156.604464
min       1165.000000
25%       1216.000000
50%       1370.000000
75%       1501.000000
max       1702.000000

/tmp/ipykernel_12194/1207073788.py:8: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query, conn)

In [24]:
#i) Filtrar clientes cuyo nombre comience con "A", 
#j) Combinar los DataFrames (que tienen las misma columna “productcode”) de productos y ventas con un merge

# Cargar los Dataframe de una consulta SQL
query = "SELECT * FROM customers;"
df_customers = fetch_data(query)

query = "SELECT * FROM products;"
df_products = fetch_data(query)

query = "SELECT * FROM sales;"
df_sales = fetch_data(query)

# Mostrar las columnas disponibles para verificar la carga
print(df_customers.columns)
print(df_products.columns)
print(df_sales.columns)

# Filtrar las ciudades cuyo nombre comience con "A"

df_customers_a = df_customers.loc[df_customers['city'].str.startswith('A')]
print(df_customers_a)

# Combinar los DataFrames (que tienen las misma columna “productcode”) de productos y ventas con un merge

df_merged = pd.merge(df_sales, df_products, on='productcode', how='inner')
print(df_merged.head())

Connected to 'datafundamental' successfully.

/tmp/ipykernel_12194/1207073788.py:8: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query(query, conn)

Connected to 'datafundamental' successfully.
Connected to 'datafundamental' successfully.
Index(['customernumber', 'customername', 'contactfirstname', 'phone',
       'address', 'city', 'state', 'postalcode', 'country',
       'salesrepemployeenumber', 'creditlimit'],
      dtype='object')
Index(['productcode', 'productname', 'productline', 'linetextdescription',
       'linehtmldescription', 'lineimage'],
      dtype='object')
Index(['ordernumber', 'orderlinenumber', 'orderdate', 'shippeddate',
       'requireddate', 'customernumber', 'employeenumber', 'productcode',
       'status', 'comments', 'quantityordered', 'priceeach', 'sales_amount'],
      dtype='object')
     customernumber                customername  contactfirstname  \
15              157       Diecast Classics Inc.      Kelvin Leong
59              303            Schuyler Imports  Bradley Schuyler
66              323  Down Under Souveniers, Inc       Mike Graham
79              357             GiftsForHim.com   Wales MacKinlay
102             459            Warburg Exchange     Sven  Ottlieb
116             496            Kellys Gift Shop      Tony Snowden

               phone                        address        city state  \
15        2155551555               7586 Pompton St.   Allentown    PA
59   +31 20 491 9555               Kingsfordweg 151   Amsterdam  None
66    +64 9 312 5555  162-164 Grafton Road, Level 2  Auckland    None
79      64-9-3763555           199 Great North Road    Auckland  None
102      0241-039123                   Walserweg 21      Aachen  None
116    +64 9 5555500               Arenales 1938 3A  Auckland    None

    postalcode      country  salesrepemployeenumber  creditlimit
15       70267          USA                  1216.0     100600.0
59     1043 GR  Netherlands                     NaN          0.0
66        None  New Zealand                  1612.0      88000.0
79        None  New Zealand                  1612.0      77700.0
102      52066      Germany                     NaN          0.0
116       None  New Zealand                  1612.0     110000.0
   ordernumber  orderlinenumber   orderdate shippeddate requireddate  \
0        10100                1  2003-01-06  2003-01-10   2003-01-13
1        10100                2  2003-01-06  2003-01-10   2003-01-13
2        10100                3  2003-01-06  2003-01-10   2003-01-13
3        10100                4  2003-01-06  2003-01-10   2003-01-13
4        10101                1  2003-01-09  2003-01-11   2003-01-18

   customernumber  employeenumber productcode   status  \
0             363            1216    S24_3969  Shipped
1             363            1216    S18_2248  Shipped
2             363            1216    S18_1749  Shipped
3             363            1216    S18_4409  Shipped
4             128            1504    S18_2795  Shipped

                 comments  quantityordered  priceeach  sales_amount  \
0                    None               49      35.29       1729.21
1                    None               50      55.09       2754.50
2                    None               30     136.00       4080.00
3                    None               22      75.46       1660.12
4  Check on availability.               26     167.06       4343.56

                           productname   productline  \
0     1936 Mercedes Benz 500k Roadster  Vintage Cars
1                   1911 Ford Town Car  Vintage Cars
2             1917 Grand Touring Sedan  Vintage Cars
3  1932 Alfa Romeo 8C2300 Spider Sport  Vintage Cars
4               1928 Mercedes-Benz SSK  Vintage Cars

                                 linetextdescription linehtmldescription  \
0  Our Vintage Car models realistically portray a...                None
1  Our Vintage Car models realistically portray a...                None
2  Our Vintage Car models realistically portray a...                None
3  Our Vintage Car models realistically portray a...                None
4  Our Vintage Car models realistically portray a...                None

  lineimage
0      None
1      None
2      None
3      None
4      None

2. Escribe un programa Pandas para conectarte a la base de datos datafundamentals y guardar el df de pagos en una tabla nueva. Luego muestra las tablas en la bbdd y comprueba que existe la nueva tabla.

**Tip:** Usar sqlalchemy (https://www.sqlalchemy.org/)
```
# !pip install sqlalchemy

from sqlalchemy import create_engine
engine = create_engine('db_url')
df.sql('table_name',engine)
```

In [25]:
!pip install sqlalchemy

Requirement already satisfied: sqlalchemy in /anaconda/envs/azureml_py38/lib/python3.10/site-packages (2.0.37)
Requirement already satisfied: typing-extensions>=4.6.0 in /anaconda/envs/azureml_py38/lib/python3.10/site-packages (from sqlalchemy) (4.12.2)
Requirement already satisfied: greenlet!=0.4.17 in /anaconda/envs/azureml_py38/lib/python3.10/site-packages (from sqlalchemy) (3.1.1)

In [26]:
from sqlalchemy import create_engine

engine = create_engine(
    'postgresql://datafundamentals_owner:KBmgp2v5AIGf@ep-spring-shape-a82ywnyf-pooler.eastus2.azure.neon.tech/datafundamentals?sslmode=require')
print(engine)

Engine(postgresql://datafundamentals_owner:***@ep-spring-shape-a82ywnyf-pooler.eastus2.azure.neon.tech/datafundamentals?sslmode=require)

3. Escribe un programa Pandas para seleccionar filas donde el valor de la columna "amount" sea mayor que 400.

In [27]:
df_payments[df_payments['amount'] > 400]

     customernumber checknumber paymentdate    amount
0               103    HQ336336  2004-10-19   6066.78
1               103    JM555205  2003-06-05  14571.44
2               103    OM314933  2004-12-18   1676.14
3               112    BO864823  2004-12-17  14191.12
4               112     HQ55022  2003-06-06  32641.98
..              ...         ...         ...       ...
254             495    BH167026  2003-12-26  59265.14
255             495    FN155234  2004-05-14   6276.60
256             496    EU531600  2005-05-25  30253.75
257             496    MB342426  2003-07-16  32077.44
258             496     MN89921  2004-12-31  52166.00

[259 rows x 4 columns]

4. Escribe un programa Pandas para seleccionar solo las columnas "checknumber" y "paymentdate" del DataFrame.

In [28]:

import pandas as pd

In [29]:

df_payments[['checknumber', 'paymentdate']]

    checknumber paymentdate
0      HQ336336  2004-10-19
1      JM555205  2003-06-05
2      OM314933  2004-12-18
3      BO864823  2004-12-17
4       HQ55022  2003-06-06
..          ...         ...
254    BH167026  2003-12-26
255    FN155234  2004-05-14
256    EU531600  2005-05-25
257    MB342426  2003-07-16
258     MN89921  2004-12-31

[259 rows x 2 columns]

5. Escribe un programa Pandas para definir un MultiIndex (multi-índice: varios índices para cada fila), basados en 2 columnas, para:
- acceder a datos específicos mediante él
- segmentar el DataFrame en función de los niveles de MultiIndex.

In [32]:
df_payments.set_index(['amount', 'paymentdate'])

                      customernumber checknumber
amount   paymentdate
6066.78  2004-10-19              103    HQ336336
14571.44 2003-06-05              103    JM555205
1676.14  2004-12-18              103    OM314933
14191.12 2004-12-17              112    BO864823
32641.98 2003-06-06              112     HQ55022
...                              ...         ...
59265.14 2003-12-26              495    BH167026
6276.60  2004-05-14              495    FN155234
30253.75 2005-05-25              496    EU531600
32077.44 2003-07-16              496    MB342426
52166.00 2004-12-31              496     MN89921

[259 rows x 2 columns]

In [37]:
midf = df_customers.set_index(['customernumber', 'customername'])

In [38]:
midf.loc[103:495]

,,contactfirstname,phone,address,city,state,postalcode,country,salesrepemployeenumber,creditlimit
customernumber,customername,,,,,,,,,
103,Atelier graphique,Carine Schmitt,40.32.2555,"54, rue Royale",Nantes,None,44000,France,1370.0,21000.0
112,Signal Gift Stores,Jean King,7025551838,8489 Strong St.,Las Vegas,NV,83030,USA,1166.0,71800.0
114,"Australian Collectors, Co.",Peter Ferguson,03 9520 4555,"636 St Kilda Road, Level 3",Melbourne,Victoria,3004,Australia,1611.0,117300.0
119,La Rochelle Gifts,Janine Labrune,40.67.8555,"67, rue des Cinquante Otages",Nantes,None,44000,France,1370.0,118200.0
121,Baane Mini Imports,Jonas Bergulfsen,07-98 9555,Erling Skakkes gate 78,Stavern,None,4110,Norway,1504.0,81700.0
...,...,...,...,...,...,...,...,...,...,...
484,"Iberia Gift Imports, Corp.",José Pedro Roel,(95) 555 82 82,"C/ Romero, 33",Sevilla,None,41101,Spain,1702.0,65700.0
486,Motor Mint Distributors Inc.,Rosa Salazar,2155559857,11328 Douglas Av.,Philadelphia,PA,71270,USA,1323.0,72600.0
487,Signal Collectibles Ltd.,Sue Taylor,4155554312,2793 Furth Circle,Brisbane,CA,94217,USA,1165.0,60300.0
489,"Double Decker Gift Stores, Ltd",Thomas Smith,(171) 555-7555,120 Hanover Sq.,London,None,WA1 1DP,UK,1501.0,43300.0
495,Diecast Collectables,Valarie Franco,6175552555,6251 Ingle Ln.,Boston,MA,51003,USA,1188.0,85100.0

5. Escribe un programa Pandas para seleccionar las primeras tres filas usando iloc.

In [40]:
df_customers.iloc[:3]

,customernumber,customername,contactfirstname,phone,address,city,state,postalcode,country,salesrepemployeenumber,creditlimit
0,103,Atelier graphique,Carine Schmitt,40.32.2555,"54, rue Royale",Nantes,None,44000,France,1370.0,21000.0
1,112,Signal Gift Stores,Jean King,7025551838,8489 Strong St.,Las Vegas,NV,83030,USA,1166.0,71800.0
2,114,"Australian Collectors, Co.",Peter Ferguson,03 9520 4555,"636 St Kilda Road, Level 3",Melbourne,Victoria,3004,Australia,1611.0,117300.0

6. Escribe un programa Pandas para usar loc para seleccionar filas aplicando una condición dada en 2 columas.

In [42]:
mask = (df_payments['amount'] > 400) & (df_payments['customernumber'] > 200)
print(mask)
df_payments.loc[mask]

0      False
1      False
2      False
3      False
4      False
       ...
254     True
255     True
256     True
257     True
258     True
Length: 259, dtype: bool

     customernumber checknumber paymentdate    amount
97              201    DP677013  2003-10-20  23908.24
98              201    OO846801  2004-06-15  37258.94
99              202    HI358554  2003-12-18  36527.61
100             202    IQ627690  2004-11-08  33594.58
101             204    GC697638  2004-08-13  51152.86
..              ...         ...         ...       ...
254             495    BH167026  2003-12-26  59265.14
255             495    FN155234  2004-05-14   6276.60
256             496    EU531600  2005-05-25  30253.75
257             496    MB342426  2003-07-16  32077.44
258             496     MN89921  2004-12-31  52166.00

[162 rows x 4 columns]

7. Escribe un programa Pandas que utilice loc para cambiar en el valor de ammount de las filas que cumplan con una condición.

In [44]:
df_payments.loc[mask, ['amount', 'paymentdate']] = (0, '2025-01-01') #LOC recibe una mascara y extrae un conjunto del df
print(df_payments.loc[mask])
print(df_payments.loc[df_payments['amount'] > 400])

     customernumber checknumber paymentdate  amount
97              201    DP677013  2025-01-01     0.0
98              201    OO846801  2025-01-01     0.0
99              202    HI358554  2025-01-01     0.0
100             202    IQ627690  2025-01-01     0.0
101             204    GC697638  2025-01-01     0.0
..              ...         ...         ...     ...
254             495    BH167026  2025-01-01     0.0
255             495    FN155234  2025-01-01     0.0
256             496    EU531600  2025-01-01     0.0
257             496    MB342426  2025-01-01     0.0
258             496     MN89921  2025-01-01     0.0

[162 rows x 4 columns]
    customernumber checknumber paymentdate    amount
0              103    HQ336336  2004-10-19   6066.78
1              103    JM555205  2003-06-05  14571.44
2              103    OM314933  2004-12-18   1676.14
3              112    BO864823  2004-12-17  14191.12
4              112     HQ55022  2003-06-06  32641.98
..             ...         ...         ...       ...
92             189    BO711618  2004-10-03  17359.53
93             189    NM916675  2004-03-01  32538.74
94             198    FI192930  2004-12-06   9658.74
95             198    HQ920205  2003-07-06   6036.96
96             198    IS946883  2004-09-21   5858.56

[97 rows x 4 columns]

8. Escribe un programa Pandas que utilice .loc para dividir un DataFrame en función de las etiquetas de filas y columnas.

9. Escribe un programa Pandas que utilice .loc para segmentar un DataFrame multi-índice.